In [1]:
import mysql.connector
import pandas as pd

# Create Connection

In [2]:
mydb = mysql.connector.connect (
host = 'localhost',
user = 'root',
password = 'shanday48',
database = 'world')

# Access to Database (1st Method)

In [3]:
# create access
mycursor = mydb.cursor()

In [4]:
query = 'select * from city'

In [5]:
mycursor.execute(query)

In [6]:
# save result
result = mycursor.fetchall()

In [7]:
df = pd.DataFrame(result, columns = mycursor.column_names)

In [8]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

# 2nd method, create function

In [9]:
# create access
mycursor = mydb.cursor()

In [10]:
# create function
def sql_df(yourQuery):
    mycursor.execute(yourQuery)
    myresult = mycursor.fetchall()
    df = pd.DataFrame(myresult, columns = mycursor.column_names)
    return df

In [11]:
sql_df('''
select * from city limit 5
''')

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200